In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
WARNING: There was an error checking the latest version of pip.

In [3]:
%load_ext sql

In [4]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [5]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [6]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [7]:
%%sql $CONNECT_DATA
    SELECT * FROM pg_database

4 rows affected.

[(13760, 'postgres', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, True, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13759, 'template0', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, False, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (16384, 'demo', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, '{=Tc/postgres,postgres=CTc/postgres,reader=c/postgres}')]

In [8]:
%sql SELECT tablename AS table FROM pg_tables WHERE tablename !~ '^(pg_|sql_)'

 * postgresql://reader:***@10.129.0.25/demo
8 rows affected.

[('boarding_passes',),
 ('aircrafts_data',),
 ('flights',),
 ('airports_data',),
 ('seats',),
 ('tickets',),
 ('ticket_flights',),
 ('bookings',)]

In [9]:
%%sql
SELECT passenger_name, passenger_id, contact_data 
FROM tickets 
WHERE ticket_no = '0005432312164'

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('ALEKSEY GERASIMOV', '0423 646487', {'email': 'a_gerasimov-22091969@postgrespro.ru', 'phone': '+70818244988'})]

1. Which fare conditions are available for flights from AER to SVO (i.e. from Adler/Sochi to Sheremetevo/Moscow)

In [10]:
%%sql
SELECT DISTINCT tf.fare_conditions
FROM ticket_flights tf
WHERE tf.flight_id IN (
    SELECT f.flight_id
    FROM flights f
    WHERE f.departure_airport = 'AER' AND f.arrival_airport = 'SVO'
);

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

2. A list of aircraft models which fly to the Yakutsk AND Abakan cities

In [11]:
%%sql
SELECT DISTINCT a.model
FROM aircrafts a
WHERE a.aircraft_code IN (
    SELECT f.aircraft_code
    FROM flights f
    WHERE f.arrival_airport IN ('YKS', 'ABA')
    GROUP BY f.aircraft_code
    HAVING COUNT(DISTINCT f.arrival_airport) = 2
);

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('Airbus A319-100',)]

3. A list of aircraft models which fly to the Yakutsk OR Abakan cities

In [12]:
%%sql
SELECT DISTINCT a.model
FROM aircrafts a
WHERE a.aircraft_code IN (
    SELECT f.aircraft_code
    FROM flights f
    WHERE f.arrival_airport IN ('YKS', 'ABA')
);

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Airbus A319-100',),
 ('Boeing 737-300',),
 ('Bombardier CRJ-200',),
 ('Cessna 208 Caravan',),
 ('Sukhoi Superjet-100',)]

4. A list of aircrafts which DON’T fly to Yakutsk city

In [16]:
%%sql
SELECT DISTINCT a.model, a.aircraft_code
FROM aircrafts a
WHERE a.aircraft_code NOT IN (
    SELECT f.aircraft_code
    FROM flights f
    WHERE f.arrival_airport = 'YKS'
);

 * postgresql://reader:***@10.129.0.25/demo
6 rows affected.

[('Airbus A320-200', '320'),
 ('Airbus A321-200', '321'),
 ('Boeing 737-300', '733'),
 ('Boeing 767-300', '763'),
 ('Boeing 777-300', '773'),
 ('Cessna 208 Caravan', 'CN1')]

5. Find out airport codes related to Mrs. 'ELLA DMITRIEVA'  - from where and to where she flew

In [33]:
%%sql
SELECT DISTINCT fl.departure_airport, fl.arrival_airport
FROM flights fl
WHERE fl.flight_id IN (
    SELECT tf.flight_id
    FROM ticket_flights tf
    WHERE tf.ticket_no IN (
        SELECT t.ticket_no
        FROM tickets t
        WHERE t.passenger_name = 'ELLA DMITRIEVA'
    )
);

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME'),
 ('MQF', 'SVX'),
 ('SVO', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO')]